# web - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.data.vercel_project_directory.default: Reading...
module.common_resources.random_password.nextauthsecret: Refreshing state... [id=none]
module.common_resources.data.vercel_project_directory.default: Read complete after 0s [id=../../../]
module.common_resources.data.aws_cognito_user_pools.user_pool: Reading...
module.common_resources.data.aws_apigatewayv2_apis.organization_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.customer_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.gateway_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.identity_api_api_gateway_id: Reading...
module.common_resources.data.aws_cognito_user_pools.user_pool: Read complete after 0s [id=production]
module.common_resources.aws_cognito_user_pool_client.default: Refreshing state... [id=4b40ic65moeoot7qjmf7arsun3]
module.common_resources.data.aws_apigatewayv2_apis.customer_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_apis.identity_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.customer_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_api.identity_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_apis.gateway_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.gateway_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_apis.organization_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.organization_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_api.customer_api_api_gateway: Read complete after 0s [id=1sv926z3fc]
module.common_resources.data.aws_apigatewayv2_api.identity_api_api_gateway: Read complete after 0s [id=c87otdqh8g]
module.common_resources.data.aws_apigatewayv2_api.gateway_api_api_gateway: Read complete after 0s [id=l09k6gy1lf]
module.common_resources.data.aws_apigatewayv2_api.organization_api_api_gateway: Read complete after 0s [id=lfdgjp94z7]
module.common_resources.vercel_project.default: Refreshing state... [id=prj_BJCb1oYIBA9lcQGSZ9FPrDahWRRN]
module.common_resources.vercel_project_domain.default: Refreshing state... [id=new-production.connectilly.com]
module.common_resources.vercel_deployment.default: Refreshing state... [id=dpl_FbvUaDkty3BuJ4FbBESMycWtfWPt]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.common_resources.vercel_deployment.default must be replaced
-/+ resource "vercel_deployment" "default" {
      ~ domains     = [ # forces replacement
          - "new-production.connectilly.com",
          - "production-web-nine.vercel.app",
          - "production-web-connectilly.vercel.app",
          - "production-web-mortezaconnectilly-connectilly.vercel.app",
        ] -> (known after apply) # forces replacement
      ~ files       = { # forces replacement
          ~ "../../../infrastructure/workspaces/common_resources/resources.tf"                                = "5097~f56a070d305e0a7c3b6111e0756c125ef7ef1f1e" -> "5339~c37b06862e8be484cb1b8276bb215c673e5ab0bc"
          ~ "../../../package.json"                                                                           = "1373~3f4f9dfb145cbf1644f1922ba315736770ce604d" -> "1373~e9d3b44e2b0ebcedb053784dbb69d0e995a95a3e"
          ~ "../../../src/clients/generate.go"                                                                = "699~67c3d323756d028736322c55641733feb621f399" -> "732~3d203ae00d8d1cf4a4bec421590828f6c0077664"
          + "../../../src/clients/openapi/connectilly/customer/v1/fetch/ConnectillyCustomerClient.ts"         = "1301~9a366e3cb7c4813cba3f9ff2bc63465f9774af45"
          - "../../../src/clients/openapi/connectilly/customer/v1/fetch/CustomerClient.ts"                    = "1290~4e374436c0933d4fb503ae34b4c90c0b6d82ab6c" -> null
          ~ "../../../src/clients/openapi/connectilly/customer/v1/fetch/index.ts"                             = "598~6369d9211bd2d230a8196962de05d7b6ff68e838" -> "620~be93ee015cada0074710189345a62cce195085ba"
          + "../../../src/clients/openapi/connectilly/identity/v1/fetch/ConnectillyIdentityClient.ts"         = "1301~9d8af676a3ffafd63de33f9cb2df060ef89b5b1a"
          - "../../../src/clients/openapi/connectilly/identity/v1/fetch/IdentityClient.ts"                    = "1290~2344cacad132dceef784645a5c22a62b21a903cc" -> null
          ~ "../../../src/clients/openapi/connectilly/identity/v1/fetch/index.ts"                             = "985~47600fa3d282c6a4e06ace917351610d3f929821" -> "1007~59b5473680c8d7c15b8c2b4a9458a58345d4ebeb"
          + "../../../src/clients/openapi/connectilly/organization/v1/fetch/ConnectillyOrganizationClient.ts" = "1329~b6eca3ddd8a65450fb7bc4f04210e3e9db416f55"
          - "../../../src/clients/openapi/connectilly/organization/v1/fetch/OrganizationClient.ts"            = "1318~380d5107e34f62191f3467c951372d52af08a116" -> null
          ~ "../../../src/clients/openapi/connectilly/organization/v1/fetch/index.ts"                         = "614~e208f6615eee2b78019ccdbdceb4b9acf362ec06" -> "636~3dbcfc72ff9f5db87c3fef7b166d5b3af42c2885"
          ~ "../../../src/pages/api/auth/[...nextauth].ts"                                                    = "3644~9207fd528118f899f5b6e8e557885dd0bc24e3aa" -> "4877~31f2e4c04c17428a65d61d7e199a10250002ecbd"
          ~ "../../../src/types/environment.d.ts"                                                             = "324~9447e4d5d668e37336c61e263cc574fbe4a9e443" -> "354~f96a483839a0118937c98b3b75896bbc9d65f9f4"
          ~ "../../../yarn.lock"                                                                              = "152706~bb2e840d1fd5ba955e5c22bdf2e648d432d61174" -> "152646~d91c8e536f0a42d0a5aeb997dda7da9784879763"
            # (83 unchanged elements hidden)
        }
      ~ id          = "dpl_FbvUaDkty3BuJ4FbBESMycWtfWPt" -> (known after apply)
      ~ url         = "production-e630iyqf6-connectilly.vercel.app" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.common_resources.vercel_project.default will be updated in-place
  ~ resource "vercel_project" "default" {
      ~ environment                = (sensitive value)
        id                         = "prj_BJCb1oYIBA9lcQGSZ9FPrDahWRRN"
        name                       = "production-web"
      + serverless_function_region = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*